{
  "format": "layers-model",
  "generatedBy": "keras v2.4.0",
  "convertedBy": "TensorFlow.js Converter v2.3.0",
  "modelTopology": {
    "keras_version": "2.4.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "functional_3",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                112,
                112,
                3
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_2"
            },
            "name": "input_2",
            "inbound_nodes": []
          },
          {
            "class_name": "Model",
            "config": {
              "name": "functional_1",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      112,
                      112,
                      3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_1"
                  },
                  "name": "input_1",
                  "inbound_nodes": []
                },
                {
                  "class_name": "ZeroPadding2D",
                  "config": {
                    "name": "zero_padding2d",
                    "trainable": false,
                    "dtype": "float32",
                    "padding": [
                      [
                        3,
                        3
                      ],
                      [
                        3,
                        3
                      ]
                    ],
                    "data_format": "channels_last"
                  },
                  "name": "zero_padding2d",
                  "inbound_nodes": [
                    [
                      [
                        "input_1",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv1/conv",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                      7,
                      7
                    ],
                    "strides": [
                      2,
                      2
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv1/conv",
                  "inbound_nodes": [
                    [
                      [
                        "zero_padding2d",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "conv1/bn",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.99,
                    "epsilon": 1.001e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "conv1/bn",
                  "inbound_nodes": [
                    [
                      [
                        "conv1/conv",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "name": "conv1/relu",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                  },
                  "name": "conv1/relu",
                  "inbound_nodes": [
                    [
                      [
                        "conv1/bn",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "ZeroPadding2D",
                  "config": {
                    "name": "zero_padding2d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "padding": [
                      [
                        1,
                        1
                      ],
                      [
                        1,
                        1
                      ]
                    ],
                    "data_format": "channels_last"
                  },
                  "name": "zero_padding2d_1",
                  "inbound_nodes": [
                    [
                      [
                        "conv1/relu",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "MaxPooling2D",
                  "config": {
                    "name": "pool1",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                      3,
                      3
                    ],
                    "padding": "valid",
                    "strides": [
                      2,
                      2
                    ],
                    "data_format": "channels_last"
                  },
                  "name": "pool1",
                  "inbound_nodes": [
                    [
                      [
                        "zero_padding2d_1",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "conv2_block1_0_bn",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.99,
                    "epsilon": 1.001e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "conv2_block1_0_bn",
                  "inbound_nodes": [
                    [
                      [
                        "pool1",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "name": "conv2_block1_0_relu",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                  },
                  "name": "conv2_block1_0_relu",
                  "inbound_nodes": [
                    [
                      [
                        "conv2_block1_0_bn",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2_block1_1_conv",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_size": [
                      1,
                      1
                    ],
                    "strides": [
                      1,
                      1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2_block1_1_conv",
                  "inbound_nodes": [
                    [
                      [
                        "conv2_block1_0_relu",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "conv2_block1_1_bn",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.99,
                    "epsilon": 1.001e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "conv2_block1_1_bn",
                  "inbound_nodes": [
                    [
                      [
                        "conv2_block1_1_conv",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "name": "conv2_block1_1_relu",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                  },
                  "name": "conv2_block1_1_relu",
                  "inbound_nodes": [
                    [
                      [
                        "conv2_block1_1_bn",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2_block1_2_conv",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_size": [
                      3,
                      3
                    ],
                    "strides": [
                      1,
                      1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2_block1_2_conv",
                  "inbound_nodes": [
                    [
                      [
                        "conv2_block1_1_relu",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Concatenate",
                  "config": {
                    "name": "conv2_block1_concat",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": 3
                  },
                  "name": "conv2_block1_concat",
                  "inbound_nodes": [
                    [
                      [
                        "pool1",
                        0,
                        0,
                        {}
                      ],
                      [
                        "conv2_block1_2_conv",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "conv2_block2_0_bn",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.99,
                    "epsilon": 1.001e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "conv2_block2_0_bn",
                  "inbound_nodes": [
                    [
                      [
                        "conv2_block1_concat",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "name": "conv2_block2_0_relu",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                  },
                  "name": "conv2_block2_0_relu",
                  "inbound_nodes": [
                    [
                      [
                        "conv2_block2_0_bn",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                }
              ],
              "input_layers": [
                [
                  "input_1",
                  0,
                  0
                ]
              ],
              "output_layers": [
                [
                  "conv2_block2_0_relu",
                  0,
                  0
                ]
              ]
            },
            "name": "functional_1",
            "inbound_nodes": [
              [
                [
                  "input_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d",
            "inbound_nodes": [
              [
                [
                  "functional_1",
                  1,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization",
              "trainable": true,
              "dtype": "float32",
              "axis": [
                3
              ],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization",
            "inbound_nodes": [
              [
                [
                  "conv2d",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "AveragePooling2D",
            "config": {
              "name": "average_pooling2d",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "name": "average_pooling2d",
            "inbound_nodes": [
              [
                [
                  "batch_normalization",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_1",
            "inbound_nodes": [
              [
                [
                  "average_pooling2d",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_1",
              "trainable": true,
              "dtype": "float32",
              "axis": [
                3
              ],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_1",
            "inbound_nodes": [
              [
                [
                  "conv2d_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "AveragePooling2D",
            "config": {
              "name": "average_pooling2d_1",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "name": "average_pooling2d_1",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                2,
                2
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_2",
            "inbound_nodes": [
              [
                [
                  "average_pooling2d_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            },
            "name": "flatten",
            "inbound_nodes": [
              [
                [
                  "conv2d_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 8,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [
              [
                [
                  "flatten",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "input_2",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "dense",
            0,
            0
          ]
        ]
      }
    },
    "training_config": {
      "loss": "mean_absolute_error",
      "metrics": "mae",
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 9.999999747378752e-05,
          "decay": 0.0,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "epsilon": 1e-07,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "landmarkWeights3.bin"
      ],
      "weights": [
        {
          "name": "batch_normalization/gamma",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/beta",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_mean",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_variance",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_mean",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_variance",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d/kernel",
          "shape": [
            3,
            3,
            96,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/kernel",
          "shape": [
            3,
            3,
            32,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/kernel",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/kernel",
          "shape": [
            576,
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2_block1_0_bn/gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2_block1_0_bn/beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2_block1_1_conv/kernel",
          "shape": [
            1,
            1,
            64,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2_block1_1_bn/gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2_block1_1_bn/beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2_block1_2_conv/kernel",
          "shape": [
            3,
            3,
            128,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2_block2_0_bn/gamma",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2_block2_0_bn/beta",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1/conv/kernel",
          "shape": [
            7,
            7,
            3,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1/bn/gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1/bn/beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1/bn/moving_mean",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1/bn/moving_variance",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2_block1_0_bn/moving_mean",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2_block1_0_bn/moving_variance",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2_block1_1_bn/moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2_block1_1_bn/moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2_block2_0_bn/moving_mean",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2_block2_0_bn/moving_variance",
          "shape": [
            96
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}