{
  "format": "layers-model",
  "generatedBy": "keras v2.4.0",
  "convertedBy": "TensorFlow.js Converter v2.3.0",
  "modelTopology": {
    "keras_version": "2.4.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_7",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                96,
                96,
                3
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_8"
            }
          },
          {
            "class_name": "Model",
            "config": {
              "name": "keras_layer_6",
              "trainable": true,
              "dtype": "float32",
              "handle": "https://tfhub.dev/google/imagenet/mobilenet_v2_035_96/feature_vector/4"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_8",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_9",
              "trainable": true,
              "dtype": "float32",
              "units": 8,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "mean_absolute_error",
      "metrics": "mae",
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 9.999999747378752e-05,
          "decay": 0.0,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "epsilon": 1e-07,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "eyeModel.bin"
      ],
      "weights": [
        {
          "name": "dense_8/kernel",
          "shape": [
            1280,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_8/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_9/kernel",
          "shape": [
            128,
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_9/bias",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_16/expand/weights",
          "shape": [
            1,
            1,
            56,
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/Conv_1/BatchNorm/gamma",
          "shape": [
            1280
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_1/depthwise/depthwise_weights",
          "shape": [
            3,
            3,
            48,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_3/project/BatchNorm/gamma",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_5/project/BatchNorm/beta",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_8/depthwise/BatchNorm/beta",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_12/project/BatchNorm/gamma",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_16/depthwise/BatchNorm/gamma",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_2/project/weights",
          "shape": [
            1,
            1,
            48,
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_10/expand/weights",
          "shape": [
            1,
            1,
            24,
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_16/project/BatchNorm/gamma",
          "shape": [
            112
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv/project/weights",
          "shape": [
            1,
            1,
            16,
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_2/expand/BatchNorm/beta",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_7/expand/BatchNorm/gamma",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_7/depthwise/BatchNorm/beta",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_8/project/BatchNorm/gamma",
          "shape": [
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_9/expand/weights",
          "shape": [
            1,
            1,
            24,
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_9/project/BatchNorm/beta",
          "shape": [
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_10/depthwise/depthwise_weights",
          "shape": [
            3,
            3,
            144,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_10/project/BatchNorm/beta",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/Conv/weights",
          "shape": [
            3,
            3,
            3,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_12/depthwise/BatchNorm/gamma",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_14/depthwise/BatchNorm/gamma",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_3/depthwise/depthwise_weights",
          "shape": [
            3,
            3,
            48,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_4/depthwise/BatchNorm/gamma",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_5/depthwise/BatchNorm/gamma",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_13/depthwise/BatchNorm/beta",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_6/depthwise/BatchNorm/gamma",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_10/depthwise/BatchNorm/gamma",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_11/project/BatchNorm/beta",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_15/project/weights",
          "shape": [
            1,
            1,
            336,
            56
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_7/expand/BatchNorm/beta",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_10/expand/BatchNorm/beta",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_15/project/BatchNorm/beta",
          "shape": [
            56
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_16/project/weights",
          "shape": [
            1,
            1,
            336,
            112
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/Conv/BatchNorm/gamma",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_1/project/BatchNorm/gamma",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_4/depthwise/depthwise_weights",
          "shape": [
            3,
            3,
            96,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_4/project/weights",
          "shape": [
            1,
            1,
            96,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_6/project/BatchNorm/beta",
          "shape": [
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_16/project/BatchNorm/beta",
          "shape": [
            112
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_8/depthwise/depthwise_weights",
          "shape": [
            3,
            3,
            144,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_9/depthwise/depthwise_weights",
          "shape": [
            3,
            3,
            144,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_9/depthwise/BatchNorm/beta",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_13/expand/weights",
          "shape": [
            1,
            1,
            32,
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/Conv/BatchNorm/beta",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_2/depthwise/BatchNorm/beta",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_5/depthwise/BatchNorm/beta",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_10/project/BatchNorm/gamma",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_1/expand/weights",
          "shape": [
            1,
            1,
            8,
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_4/project/BatchNorm/gamma",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_6/expand/BatchNorm/gamma",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_11/depthwise/BatchNorm/gamma",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_12/project/weights",
          "shape": [
            1,
            1,
            192,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_12/depthwise/BatchNorm/beta",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_16/expand/BatchNorm/gamma",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_7/project/BatchNorm/beta",
          "shape": [
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_13/project/BatchNorm/gamma",
          "shape": [
            56
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_14/project/BatchNorm/gamma",
          "shape": [
            56
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_1/expand/BatchNorm/gamma",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_1/project/weights",
          "shape": [
            1,
            1,
            48,
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_6/project/BatchNorm/gamma",
          "shape": [
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_7/depthwise/BatchNorm/gamma",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_10/depthwise/BatchNorm/beta",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_12/expand/BatchNorm/beta",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_13/project/weights",
          "shape": [
            1,
            1,
            192,
            56
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_2/expand/weights",
          "shape": [
            1,
            1,
            8,
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_8/expand/weights",
          "shape": [
            1,
            1,
            24,
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_10/expand/BatchNorm/gamma",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_5/expand/weights",
          "shape": [
            1,
            1,
            16,
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_8/expand/BatchNorm/gamma",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_9/project/BatchNorm/gamma",
          "shape": [
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_12/expand/BatchNorm/gamma",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_13/expand/BatchNorm/gamma",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_14/depthwise/depthwise_weights",
          "shape": [
            3,
            3,
            336,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/Conv_1/BatchNorm/beta",
          "shape": [
            1280
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_3/expand/BatchNorm/beta",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_2/project/BatchNorm/beta",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_6/expand/weights",
          "shape": [
            1,
            1,
            16,
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_6/depthwise/BatchNorm/beta",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_13/depthwise/depthwise_weights",
          "shape": [
            3,
            3,
            192,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_15/project/BatchNorm/gamma",
          "shape": [
            56
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_3/project/weights",
          "shape": [
            1,
            1,
            48,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_16/depthwise/depthwise_weights",
          "shape": [
            3,
            3,
            336,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/Conv_1/weights",
          "shape": [
            1,
            1,
            112,
            1280
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_3/project/BatchNorm/beta",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_7/project/weights",
          "shape": [
            1,
            1,
            144,
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_11/depthwise/depthwise_weights",
          "shape": [
            3,
            3,
            192,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_12/project/BatchNorm/beta",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_15/depthwise/BatchNorm/gamma",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_3/depthwise/BatchNorm/beta",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_5/expand/BatchNorm/beta",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_5/project/BatchNorm/gamma",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_11/expand/BatchNorm/beta",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_11/project/weights",
          "shape": [
            1,
            1,
            192,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_14/project/BatchNorm/beta",
          "shape": [
            56
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_15/depthwise/BatchNorm/beta",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_16/depthwise/BatchNorm/beta",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_14/expand/BatchNorm/gamma",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_3/expand/BatchNorm/gamma",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_3/expand/weights",
          "shape": [
            1,
            1,
            8,
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_4/expand/weights",
          "shape": [
            1,
            1,
            16,
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_8/expand/BatchNorm/beta",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_8/project/BatchNorm/beta",
          "shape": [
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_12/expand/weights",
          "shape": [
            1,
            1,
            32,
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_13/depthwise/BatchNorm/gamma",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_16/expand/BatchNorm/beta",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_4/expand/BatchNorm/gamma",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_11/depthwise/BatchNorm/beta",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_11/project/BatchNorm/gamma",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_12/depthwise/depthwise_weights",
          "shape": [
            3,
            3,
            192,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_3/depthwise/BatchNorm/gamma",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_6/depthwise/depthwise_weights",
          "shape": [
            3,
            3,
            96,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_13/expand/BatchNorm/beta",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_13/project/BatchNorm/beta",
          "shape": [
            56
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_1/depthwise/BatchNorm/gamma",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_2/project/BatchNorm/gamma",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_15/expand/weights",
          "shape": [
            1,
            1,
            56,
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_10/project/weights",
          "shape": [
            1,
            1,
            144,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_14/expand/weights",
          "shape": [
            1,
            1,
            56,
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_14/project/weights",
          "shape": [
            1,
            1,
            336,
            56
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv/project/BatchNorm/gamma",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_1/project/BatchNorm/beta",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_5/expand/BatchNorm/gamma",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_6/expand/BatchNorm/beta",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_7/expand/weights",
          "shape": [
            1,
            1,
            24,
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_7/depthwise/depthwise_weights",
          "shape": [
            3,
            3,
            144,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_8/project/weights",
          "shape": [
            1,
            1,
            144,
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_1/depthwise/BatchNorm/beta",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_5/depthwise/depthwise_weights",
          "shape": [
            3,
            3,
            96,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_8/depthwise/BatchNorm/gamma",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_7/project/BatchNorm/gamma",
          "shape": [
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_2/depthwise/BatchNorm/gamma",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_4/expand/BatchNorm/beta",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_4/project/BatchNorm/beta",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_1/expand/BatchNorm/beta",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv/depthwise/depthwise_weights",
          "shape": [
            3,
            3,
            16,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_2/expand/BatchNorm/gamma",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_9/expand/BatchNorm/gamma",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_11/expand/BatchNorm/gamma",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_15/expand/BatchNorm/beta",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv/project/BatchNorm/beta",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_4/depthwise/BatchNorm/beta",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_6/project/weights",
          "shape": [
            1,
            1,
            96,
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_9/depthwise/BatchNorm/gamma",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_14/expand/BatchNorm/beta",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_14/depthwise/BatchNorm/beta",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_15/expand/BatchNorm/gamma",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_15/depthwise/depthwise_weights",
          "shape": [
            3,
            3,
            336,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv/depthwise/BatchNorm/beta",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_2/depthwise/depthwise_weights",
          "shape": [
            3,
            3,
            48,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_5/project/weights",
          "shape": [
            1,
            1,
            96,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_9/expand/BatchNorm/beta",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_9/project/weights",
          "shape": [
            1,
            1,
            144,
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_11/expand/weights",
          "shape": [
            1,
            1,
            32,
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/Conv/BatchNorm/moving_variance",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_11/expand/BatchNorm/moving_mean",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_11/expand/BatchNorm/moving_variance",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_11/project/BatchNorm/moving_variance",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_7/project/BatchNorm/moving_mean",
          "shape": [
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv/project/BatchNorm/moving_mean",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_1/depthwise/BatchNorm/moving_variance",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_12/depthwise/BatchNorm/moving_mean",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_2/depthwise/BatchNorm/moving_mean",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_4/depthwise/BatchNorm/moving_variance",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_8/depthwise/BatchNorm/moving_variance",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_9/expand/BatchNorm/moving_mean",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_10/depthwise/BatchNorm/moving_variance",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_13/expand/BatchNorm/moving_variance",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_1/expand/BatchNorm/moving_variance",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_14/expand/BatchNorm/moving_mean",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_6/depthwise/BatchNorm/moving_variance",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_7/project/BatchNorm/moving_variance",
          "shape": [
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_5/depthwise/BatchNorm/moving_mean",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_3/project/BatchNorm/moving_mean",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv/project/BatchNorm/moving_variance",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_3/expand/BatchNorm/moving_variance",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_12/project/BatchNorm/moving_mean",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_15/project/BatchNorm/moving_variance",
          "shape": [
            56
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_16/depthwise/BatchNorm/moving_mean",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_2/depthwise/BatchNorm/moving_variance",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_4/depthwise/BatchNorm/moving_mean",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_7/expand/BatchNorm/moving_variance",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_8/project/BatchNorm/moving_mean",
          "shape": [
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_9/expand/BatchNorm/moving_variance",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_10/expand/BatchNorm/moving_mean",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_4/expand/BatchNorm/moving_variance",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_6/project/BatchNorm/moving_variance",
          "shape": [
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_8/depthwise/BatchNorm/moving_mean",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_9/depthwise/BatchNorm/moving_variance",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_11/depthwise/BatchNorm/moving_mean",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_6/expand/BatchNorm/moving_mean",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_6/project/BatchNorm/moving_mean",
          "shape": [
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_13/project/BatchNorm/moving_mean",
          "shape": [
            56
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_15/expand/BatchNorm/moving_mean",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_3/project/BatchNorm/moving_variance",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_6/depthwise/BatchNorm/moving_mean",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_12/project/BatchNorm/moving_variance",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_12/expand/BatchNorm/moving_mean",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_5/expand/BatchNorm/moving_variance",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_3/expand/BatchNorm/moving_mean",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_8/project/BatchNorm/moving_variance",
          "shape": [
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_14/depthwise/BatchNorm/moving_variance",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_1/expand/BatchNorm/moving_mean",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_5/project/BatchNorm/moving_variance",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_14/depthwise/BatchNorm/moving_mean",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_10/expand/BatchNorm/moving_variance",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_12/expand/BatchNorm/moving_variance",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_13/expand/BatchNorm/moving_mean",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_13/project/BatchNorm/moving_variance",
          "shape": [
            56
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_4/project/BatchNorm/moving_mean",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_2/expand/BatchNorm/moving_variance",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_2/project/BatchNorm/moving_variance",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_14/project/BatchNorm/moving_variance",
          "shape": [
            56
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_16/project/BatchNorm/moving_mean",
          "shape": [
            112
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_16/expand/BatchNorm/moving_variance",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_1/project/BatchNorm/moving_variance",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_7/depthwise/BatchNorm/moving_variance",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_10/project/BatchNorm/moving_variance",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_5/depthwise/BatchNorm/moving_variance",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_15/depthwise/BatchNorm/moving_variance",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_1/depthwise/BatchNorm/moving_mean",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_9/project/BatchNorm/moving_mean",
          "shape": [
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_13/depthwise/BatchNorm/moving_mean",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/Conv_1/BatchNorm/moving_variance",
          "shape": [
            1280
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_4/expand/BatchNorm/moving_mean",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_4/project/BatchNorm/moving_variance",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_7/expand/BatchNorm/moving_mean",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_15/expand/BatchNorm/moving_variance",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_15/depthwise/BatchNorm/moving_mean",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_16/project/BatchNorm/moving_variance",
          "shape": [
            112
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_11/depthwise/BatchNorm/moving_variance",
          "shape": [
            192
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_7/depthwise/BatchNorm/moving_mean",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_8/expand/BatchNorm/moving_mean",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_10/depthwise/BatchNorm/moving_mean",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_3/depthwise/BatchNorm/moving_mean",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_5/project/BatchNorm/moving_mean",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_10/project/BatchNorm/moving_mean",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_14/project/BatchNorm/moving_mean",
          "shape": [
            56
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_16/expand/BatchNorm/moving_mean",
          "shape": [
            336
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_5/expand/BatchNorm/moving_mean",
          "shape": [
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_1/project/BatchNorm/moving_mean",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_3/depthwise/BatchNorm/moving_variance",
          "shape": [
            48
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_9/depthwise/BatchNorm/moving_mean",
          "shape": [
            144
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_9/project/BatchNorm/moving_variance",
          "shape": [
            24
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_11/project/BatchNorm/moving_mean",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_2/project/BatchNorm/moving_mean",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/expanded_conv_15/project/BatchNorm/moving_mean",
          "shape": [
            56
          ],
          "dtype": "float32"
        },
        {
          "name": "MobilenetV2/Conv_1/BatchNorm/moving_mean",
          "shape": [
            1280
