{
  "format": "layers-model",
  "generatedBy": "keras v2.4.0",
  "convertedBy": "TensorFlow.js Converter v2.3.0",
  "modelTopology": {
    "keras_version": "2.4.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "functional_3",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                160,
                160,
                3
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_2"
            },
            "name": "input_2",
            "inbound_nodes": []
          },
          {
            "class_name": "Model",
            "config": {
              "name": "functional_1",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      160,
                      160,
                      3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_1"
                  },
                  "name": "input_1",
                  "inbound_nodes": []
                },
                {
                  "class_name": "ZeroPadding2D",
                  "config": {
                    "name": "Conv1_pad",
                    "trainable": false,
                    "dtype": "float32",
                    "padding": [
                      [
                        0,
                        1
                      ],
                      [
                        0,
                        1
                      ]
                    ],
                    "data_format": "channels_last"
                  },
                  "name": "Conv1_pad",
                  "inbound_nodes": [
                    [
                      [
                        "input_1",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "Conv1",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_size": [
                      3,
                      3
                    ],
                    "strides": [
                      2,
                      2
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "Conv1",
                  "inbound_nodes": [
                    [
                      [
                        "Conv1_pad",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "bn_Conv1",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.999,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "bn_Conv1",
                  "inbound_nodes": [
                    [
                      [
                        "Conv1",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "Conv1_relu",
                    "trainable": false,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "Conv1_relu",
                  "inbound_nodes": [
                    [
                      [
                        "bn_Conv1",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "DepthwiseConv2D",
                  "config": {
                    "name": "expanded_conv_depthwise",
                    "trainable": false,
                    "dtype": "float32",
                    "kernel_size": [
                      3,
                      3
                    ],
                    "strides": [
                      1,
                      1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "depth_multiplier": 1,
                    "depthwise_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "depthwise_regularizer": null,
                    "depthwise_constraint": null
                  },
                  "name": "expanded_conv_depthwise",
                  "inbound_nodes": [
                    [
                      [
                        "Conv1_relu",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "expanded_conv_depthwise_BN",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.999,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "expanded_conv_depthwise_BN",
                  "inbound_nodes": [
                    [
                      [
                        "expanded_conv_depthwise",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "expanded_conv_depthwise_relu",
                    "trainable": false,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "expanded_conv_depthwise_relu",
                  "inbound_nodes": [
                    [
                      [
                        "expanded_conv_depthwise_BN",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "expanded_conv_project",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 16,
                    "kernel_size": [
                      1,
                      1
                    ],
                    "strides": [
                      1,
                      1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "expanded_conv_project",
                  "inbound_nodes": [
                    [
                      [
                        "expanded_conv_depthwise_relu",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "expanded_conv_project_BN",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.999,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "expanded_conv_project_BN",
                  "inbound_nodes": [
                    [
                      [
                        "expanded_conv_project",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "block_1_expand",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 96,
                    "kernel_size": [
                      1,
                      1
                    ],
                    "strides": [
                      1,
                      1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "block_1_expand",
                  "inbound_nodes": [
                    [
                      [
                        "expanded_conv_project_BN",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "block_1_expand_BN",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.999,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "block_1_expand_BN",
                  "inbound_nodes": [
                    [
                      [
                        "block_1_expand",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "block_1_expand_relu",
                    "trainable": false,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "block_1_expand_relu",
                  "inbound_nodes": [
                    [
                      [
                        "block_1_expand_BN",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "ZeroPadding2D",
                  "config": {
                    "name": "block_1_pad",
                    "trainable": false,
                    "dtype": "float32",
                    "padding": [
                      [
                        0,
                        1
                      ],
                      [
                        0,
                        1
                      ]
                    ],
                    "data_format": "channels_last"
                  },
                  "name": "block_1_pad",
                  "inbound_nodes": [
                    [
                      [
                        "block_1_expand_relu",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "DepthwiseConv2D",
                  "config": {
                    "name": "block_1_depthwise",
                    "trainable": false,
                    "dtype": "float32",
                    "kernel_size": [
                      3,
                      3
                    ],
                    "strides": [
                      2,
                      2
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "depth_multiplier": 1,
                    "depthwise_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "depthwise_regularizer": null,
                    "depthwise_constraint": null
                  },
                  "name": "block_1_depthwise",
                  "inbound_nodes": [
                    [
                      [
                        "block_1_pad",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "block_1_depthwise_BN",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.999,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "block_1_depthwise_BN",
                  "inbound_nodes": [
                    [
                      [
                        "block_1_depthwise",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "block_1_depthwise_relu",
                    "trainable": false,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "block_1_depthwise_relu",
                  "inbound_nodes": [
                    [
                      [
                        "block_1_depthwise_BN",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "block_1_project",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 24,
                    "kernel_size": [
                      1,
                      1
                    ],
                    "strides": [
                      1,
                      1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "block_1_project",
                  "inbound_nodes": [
                    [
                      [
                        "block_1_depthwise_relu",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "block_1_project_BN",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.999,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "block_1_project_BN",
                  "inbound_nodes": [
                    [
                      [
                        "block_1_project",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "block_2_expand",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 144,
                    "kernel_size": [
                      1,
                      1
                    ],
                    "strides": [
                      1,
                      1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "block_2_expand",
                  "inbound_nodes": [
                    [
                      [
                        "block_1_project_BN",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "block_2_expand_BN",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.999,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "block_2_expand_BN",
                  "inbound_nodes": [
                    [
                      [
                        "block_2_expand",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "block_2_expand_relu",
                    "trainable": false,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "block_2_expand_relu",
                  "inbound_nodes": [
                    [
                      [
                        "block_2_expand_BN",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "DepthwiseConv2D",
                  "config": {
                    "name": "block_2_depthwise",
                    "trainable": false,
                    "dtype": "float32",
                    "kernel_size": [
                      3,
                      3
                    ],
                    "strides": [
                      1,
                      1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "depth_multiplier": 1,
                    "depthwise_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "depthwise_regularizer": null,
                    "depthwise_constraint": null
                  },
                  "name": "block_2_depthwise",
                  "inbound_nodes": [
                    [
                      [
                        "block_2_expand_relu",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "block_2_depthwise_BN",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.999,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "block_2_depthwise_BN",
                  "inbound_nodes": [
                    [
                      [
                        "block_2_depthwise",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "block_2_depthwise_relu",
                    "trainable": false,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "block_2_depthwise_relu",
                  "inbound_nodes": [
                    [
                      [
                        "block_2_depthwise_BN",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "block_2_project",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 24,
                    "kernel_size": [
                      1,
                      1
                    ],
                    "strides": [
                      1,
                      1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "block_2_project",
                  "inbound_nodes": [
                    [
                      [
                        "block_2_depthwise_relu",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "block_2_project_BN",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.999,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "block_2_project_BN",
                  "inbound_nodes": [
                    [
                      [
                        "block_2_project",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Add",
                  "config": {
                    "name": "block_2_add",
                    "trainable": false,
                    "dtype": "float32"
                  },
                  "name": "block_2_add",
                  "inbound_nodes": [
                    [
                      [
                        "block_1_project_BN",
                        0,
                        0,
                        {}
                      ],
                      [
                        "block_2_project_BN",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "block_3_expand",
                    "trainable": false,
                    "dtype": "float32",
                    "filters": 144,
                    "kernel_size": [
                      1,
                      1
                    ],
                    "strides": [
                      1,
                      1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "block_3_expand",
                  "inbound_nodes": [
                    [
                      [
                        "block_2_add",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "block_3_expand_BN",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.999,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "block_3_expand_BN",
                  "inbound_nodes": [
                    [
                      [
                        "block_3_expand",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "block_3_expand_relu",
                    "trainable": false,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "block_3_expand_relu",
                  "inbound_nodes": [
                    [
                      [
                        "block_3_expand_BN",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "ZeroPadding2D",
                  "config": {
                    "name": "block_3_pad",
                    "trainable": false,
                    "dtype": "float32",
                    "padding": [
                      [
                        0,
                        1
                      ],
                      [
                        0,
                        1
                      ]
                    ],
                    "data_format": "channels_last"
                  },
                  "name": "block_3_pad",
                  "inbound_nodes": [
                    [
                      [
                        "block_3_expand_relu",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "DepthwiseConv2D",
                  "config": {
                    "name": "block_3_depthwise",
                    "trainable": false,
                    "dtype": "float32",
                    "kernel_size": [
                      3,
                      3
                    ],
                    "strides": [
                      2,
                      2
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "depth_multiplier": 1,
                    "depthwise_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "depthwise_regularizer": null,
                    "depthwise_constraint": null
                  },
                  "name": "block_3_depthwise",
                  "inbound_nodes": [
                    [
                      [
                        "block_3_pad",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "block_3_depthwise_BN",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.999,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "block_3_depthwise_BN",
                  "inbound_nodes": [
                    [
                      [
                        "block_3_depthwise",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "block_3_depthwise_relu",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": 6.0,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "block_3_depthwise_relu",
                  "inbound_nodes": [
                    [
                      [
                        "block_3_depthwise_BN",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "block_3_project",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_size": [
                      1,
                      1
                    ],
                    "strides": [
                      1,
                      1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "block_3_project",
                  "inbound_nodes": [
                    [
                      [
                        "block_3_depthwise_relu",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "block_3_project_BN",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                      3
                    ],
                    "momentum": 0.999,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
